IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        77 HI PIC X(12) VALUE "HOLA, MUNDO!".
PROCEDURE DIVISION.

    DISPLAY HI.
STOP RUN.
