       IDENTIFICATION DIVISION.
       PROGRAM-ID. RETO5.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
            DISPLAY "¡Hola mundo!"
            STOP RUN.
