IDENTIFICATION DIVISION.
PROGRAM-ID. FIZZBUZZ.

ENVIRONMENT DIVISION.

DATA DIVISION.

PROCEDURE DIVISION.

PERFORM VARYING I FROM 1 BY 1 UNTIL I > 100
  IF I MOD 15 = 0 THEN
    DISPLAY 'FIZZBUZZ'
  ELSE IF I MOD 3 = 0 THEN
    DISPLAY 'FIZZ'
  ELSE IF I MOD 5 = 0 THEN
    DISPLAY 'BUZZ'
  ELSE
    DISPLAY I
END-PERFORM.

STOP RUN.
